### 1.Importing modules that interact with the database.

In [1]:
import sqlalchemy 
import pandas as pd
import psycopg2

### 2.Create a connection to the database.

In [2]:
engine = sqlalchemy.create_engine("postgresql://postgres:Candidcoco@20@localhost:5432/postgres")

### 3.Load sql extension.

In [3]:
%load_ext sql

### 4.Establish the connection.

In [4]:
%sql $engine.url

'Connected: postgres@postgres'

In [5]:
columns=['sales_id','product_name','buying_price','selling_price','sales_quantity','sales_created_at']
df = pd.DataFrame(columns=columns)

### 5.Querying tables from the database.

In [6]:
data_to_insert = %sql SELECT sales.id as sales_id, name as product_name, buying_price, selling_price, sales.quantity as sales_quantity, created_at as sales_created_at from products, sales WHERE products.id = sales.pid
for row_data in data_to_insert:
    df.loc[len(df)] = row_data
df.set_index('sales_id',inplace=False,verify_integrity=False)

 * postgresql://postgres:***@localhost:5432/postgres
1016 rows affected.

,product_name,buying_price,selling_price,sales_quantity,sales_created_at
sales_id,,,,,
2,cake,10.00,20.00,20,2023-05-15 20:16:06.752490
20,Garam Marsala,77.00,190.00,2,2023-07-28 14:40:40.307220
3,pineapple,70.00,200.00,20,2023-05-15 20:19:13.124052
1,sweet,70.00,80.00,49,2023-06-16 00:00:00.000000
6,popcorn,50.00,50.00,9,2023-05-06 00:00:00.000000
...,...,...,...,...,...
300,Snapple - Mango Maddness,555.80,199.00,80,2023-07-29 00:00:00.000000
780,Snapple - Mango Maddness,555.80,199.00,39,2023-07-29 00:00:00.000000
918,Snapple - Mango Maddness,555.80,199.00,90,2023-07-29 00:00:00.000000
928,Snapple - Mango Maddness,555.80,199.00,60,2023-07-29 00:00:00.000000
993,Snapple - Mango Maddness,555.80,199.00,56,2023-07-29 00:00:00.000000

In [7]:
df.shape

(1016, 6)

In [8]:
new_df = df.append(df)
new_df.shape

(2032, 6)

### 6. Removing duplicates.

In [9]:
new_df = df.drop_duplicates()
new_df.shape

(1016, 6)